/*
 * 1. Есть список целых чисел. Создайте функцию, используйте вектор и верните из списка:
 * среднее значение; медиану (значение элемента из середины списка после его сортировки);
 * моду списка (mode of list, то значение которое встречается в списке наибольшее количество раз;
 * HashMap будет полезна в данном случае).
 * 2. Преобразуйте строку в кодировку "поросячьей латыни" (Pig Latin). Первая согласная каждого
 * слова перемещается в конец и к ней добавляется окончание "ay", так "first" станет "irst-fay".
 * Слову, начинающемуся на гласную, в конец добавляется "hay" ("apple" становится "apple-hay").
 * Помните о деталях работы с кодировкой UTF-8!
 * 3. Используя хеш-карту и векторы, создайте текстовый интерфейс позволяющий пользователю
 * добавлять имена сотрудников к названию отдела компании. Например, "Add Sally to Engineering"
 * или "Add Amir to Sales". Затем позвольте пользователю получить список всех людей из отдела
 * или всех людей в компании, отсортированных по отделам в алфавитном порядке.
 */

fn main() {
    println!("test");
}
